Revit 2024 API
BuiltInFailures.SketchFailures.FloorDirectionNotSpecified Property
 Structural floor span direction not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FloorDirectionNotSpecified { get; }
Visual Basic
Public Shared ReadOnly Property FloorDirectionNotSpecified As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FloorDirectionNotSpecified {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace